; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v11 ?v7)
             (pred_2 ?v8 ?v5)
             (pred_11 ?v11 ?v5)
             (pred_12 ?v13 ?v11 )
	     (pred_7 ?v11)
             (pred_6 ?v1)
             (pred_1 ?v8)
             (pred_3 ?v5)
             (pred_9 ?v11)
             (pred_8 ?v8)
             (pred_4 ?v11)
             (pred_5 ))



(:action op_3
:parameters (?v9 ?v2 ?v6 ?v3)
:precondition (and (pred_6 ?v9) (pred_6 ?v2) (pred_1 ?v6) (pred_3 ?v3)
          (pred_10 ?v9 ?v2) (pred_2 ?v6 ?v3)
                   (pred_11 ?v2 ?v3) (pred_7 ?v9) 
                   (pred_9 ?v2) (pred_8 ?v6))
:effect (and  (pred_4 ?v2) (not (pred_9 ?v2))))


(:action op_4
:parameters (?v9 ?v12)
:precondition (and (pred_6 ?v9) (pred_6 ?v12)
               (pred_7 ?v9) (pred_10 ?v9 ?v12) (pred_4 ?v12))
:effect (and (pred_7 ?v12) (not (pred_7 ?v9))))

(:action op_5
:parameters (?v9 ?v6)
:precondition (and (pred_6 ?v9) (pred_1 ?v6) 
                  (pred_7 ?v9) (pred_12 ?v6 ?v9) (pred_5 ))
:effect (and (pred_8 ?v6)
   (not (pred_12 ?v6 ?v9)) (not (pred_5 ))))


(:action op_2
:parameters (?v9 ?v10 ?v4)
:precondition (and (pred_6 ?v9) (pred_1 ?v10) (pred_1 ?v4)
                  (pred_7 ?v9) (pred_8 ?v4) (pred_12 ?v10 ?v9))
:effect (and (pred_8 ?v10) (pred_12 ?v4 ?v9)
        (not (pred_8 ?v4)) (not (pred_12 ?v10 ?v9))))

(:action op_1
:parameters (?v9 ?v6)
:precondition (and (pred_6 ?v9) (pred_1 ?v6) 
                  (pred_7 ?v9) (pred_8 ?v6))
:effect (and (pred_5 ) (pred_12 ?v6 ?v9) (not (pred_8 ?v6)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_08 obj_11 obj_20 obj_13 obj_15 obj_19 obj_02 obj_12 obj_01 obj_14 obj_16 obj_18 obj_21 obj_06 obj_04
    obj_10 obj_05 obj_03
    obj_22 obj_17 obj_09
    )

    (:init
       (pred_5)

       (pred_6 obj_07)
       (pred_6 obj_08)
       (pred_6 obj_11)
       (pred_6 obj_20)
       (pred_6 obj_13)
       (pred_6 obj_15)
       (pred_6 obj_19)
       (pred_6 obj_02)
       (pred_6 obj_12)
       (pred_6 obj_01)
       (pred_6 obj_14)
       (pred_6 obj_16)
       (pred_6 obj_18)
       (pred_6 obj_21)
       (pred_6 obj_06)
       (pred_6 obj_04)
       (pred_3 obj_10)
       (pred_3 obj_05)
       (pred_3 obj_03)
       (pred_1 obj_22)
       (pred_1 obj_17)
       (pred_1 obj_09)

       (pred_10 obj_07 obj_13)
       (pred_10 obj_07 obj_08)
       (pred_10 obj_08 obj_15)
       (pred_10 obj_08 obj_11)
       (pred_10 obj_08 obj_07)
       (pred_10 obj_11 obj_19)
       (pred_10 obj_11 obj_20)
       (pred_10 obj_11 obj_08)
       (pred_10 obj_20 obj_02)
       (pred_10 obj_20 obj_11)
       (pred_10 obj_13 obj_12)
       (pred_10 obj_13 obj_15)
       (pred_10 obj_13 obj_07)
       (pred_10 obj_15 obj_01)
       (pred_10 obj_15 obj_19)
       (pred_10 obj_15 obj_08)
       (pred_10 obj_15 obj_13)
       (pred_10 obj_19 obj_14)
       (pred_10 obj_19 obj_02)
       (pred_10 obj_19 obj_11)
       (pred_10 obj_19 obj_15)
       (pred_10 obj_02 obj_16)
       (pred_10 obj_02 obj_20)
       (pred_10 obj_02 obj_19)
       (pred_10 obj_12 obj_18)
       (pred_10 obj_12 obj_01)
       (pred_10 obj_12 obj_13)
       (pred_10 obj_01 obj_21)
       (pred_10 obj_01 obj_14)
       (pred_10 obj_01 obj_15)
       (pred_10 obj_01 obj_12)
       (pred_10 obj_14 obj_06)
       (pred_10 obj_14 obj_16)
       (pred_10 obj_14 obj_19)
       (pred_10 obj_14 obj_01)
       (pred_10 obj_16 obj_04)
       (pred_10 obj_16 obj_02)
       (pred_10 obj_16 obj_14)
       (pred_10 obj_18 obj_21)
       (pred_10 obj_18 obj_12)
       (pred_10 obj_21 obj_06)
       (pred_10 obj_21 obj_01)
       (pred_10 obj_21 obj_18)
       (pred_10 obj_06 obj_04)
       (pred_10 obj_06 obj_14)
       (pred_10 obj_06 obj_21)
       (pred_10 obj_04 obj_16)
       (pred_10 obj_04 obj_06)
       (pred_9 obj_07)
       (pred_9 obj_01)
       (pred_9 obj_16)
       (pred_11  obj_07 obj_10)
       (pred_11  obj_01 obj_05)
       (pred_11  obj_16 obj_03)
       (pred_4 obj_08)
       (pred_4 obj_11)
       (pred_4 obj_20)
       (pred_4 obj_13)
       (pred_4 obj_15)
       (pred_4 obj_19)
       (pred_4 obj_02)
       (pred_4 obj_12)
       (pred_4 obj_14)
       (pred_4 obj_18)
       (pred_4 obj_21)
       (pred_4 obj_06)
       (pred_4 obj_04)

       (pred_2  obj_22 obj_10)
       (pred_2  obj_17 obj_05)
       (pred_2  obj_09 obj_03)
       (pred_12 obj_22 obj_08)
       (pred_12 obj_17 obj_20)
       (pred_12 obj_09 obj_02)
       (pred_7 obj_13)
    )

    (:goal (and
       (pred_12 obj_22 obj_13)
       (pred_12 obj_17 obj_21)
    ))
(:constraints
  (always (not (pred_7 obj_15)))
)
)

; plan
1. (op_4 obj_13 obj_12)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_12)
   goals met: 0 of 2
2. (op_4 obj_12 obj_18)
   deleted: (pred_7 obj_12)
   added: (pred_7 obj_18)
   goals met: 0 of 2
3. (op_4 obj_18 obj_21)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_21)
   goals met: 0 of 2
4. (op_4 obj_21 obj_06)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_06)
   goals met: 0 of 2
5. (op_4 obj_06 obj_14)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_14)
   goals met: 0 of 2
6. (op_4 obj_14 obj_19)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_19)
   goals met: 0 of 2
7. (op_4 obj_19 obj_11)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_11)
   goals met: 0 of 2
8. (op_4 obj_11 obj_20)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_20)
   goals met: 0 of 2
9. (op_5 obj_20 obj_17)
   deleted: (pred_12 obj_17 obj_20) (pred_5)
   added: (pred_8 obj_17)
   goals met: 0 of 2
10. (op_4 obj_20 obj_11)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_11)
   goals met: 0 of 2
11. (op_4 obj_11 obj_08)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_08)
   goals met: 0 of 2
12. (op_2 obj_08 obj_22 obj_17)
   deleted: (pred_8 obj_17) (pred_12 obj_22 obj_08)
   added: (pred_8 obj_22) (pred_12 obj_17 obj_08)
   goals met: 0 of 2
13. (op_3 obj_08 obj_07 obj_22 obj_10)
   deleted: (pred_9 obj_07)
   added: (pred_4 obj_07)
   goals met: 0 of 2
14. (op_4 obj_08 obj_07)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_07)
   goals met: 0 of 2
15. (op_4 obj_07 obj_13)
   deleted: (pred_7 obj_07)
   added: (pred_7 obj_13)
   goals met: 0 of 2
16. (op_1 obj_13 obj_22)
   deleted: (pred_8 obj_22)
   added: (pred_5) (pred_12 obj_22 obj_13)
   goals met: 1 of 2
17. (op_4 obj_13 obj_07)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_07)
   goals met: 1 of 2
18. (op_4 obj_07 obj_08)
   deleted: (pred_7 obj_07)
   added: (pred_7 obj_08)
   goals met: 1 of 2
19. (op_5 obj_08 obj_17)
   deleted: (pred_12 obj_17 obj_08) (pred_5)
   added: (pred_8 obj_17)
   goals met: 1 of 2
20. (op_4 obj_08 obj_07)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_07)
   goals met: 1 of 2
21. (op_4 obj_07 obj_13)
   deleted: (pred_7 obj_07)
   added: (pred_7 obj_13)
   goals met: 1 of 2
22. (op_4 obj_13 obj_12)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_12)
   goals met: 1 of 2
23. (op_4 obj_12 obj_18)
   deleted: (pred_7 obj_12)
   added: (pred_7 obj_18)
   goals met: 1 of 2
24. (op_4 obj_18 obj_21)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_21)
   goals met: 1 of 2
25. (op_1 obj_21 obj_17)
   deleted: (pred_8 obj_17)
   added: (pred_5) (pred_12 obj_17 obj_21)
   goals met: 2 of 2
